In [1]:
import pandas as pd
df=pd.read_csv('cars.csv')

In [2]:
df.head()

     brand  km_driven    fuel         owner  selling_price
0   Maruti     145500  Diesel   First Owner         450000
1    Skoda     120000  Diesel  Second Owner         370000
2    Honda     140000  Petrol   Third Owner         158000
3  Hyundai     127000  Diesel   First Owner         225000
4   Maruti     120000  Petrol   First Owner         130000

In [3]:
df['brand'].nunique()

32

In [4]:
df['owner'].value_counts()

owner
First Owner             5289
Second Owner            2105
Third Owner              555
Fourth & Above Owner     174
Test Drive Car             5
Name: count, dtype: int64

#One hot encoding

In [5]:
df.head(2)

    brand  km_driven    fuel         owner  selling_price
0  Maruti     145500  Diesel   First Owner         450000
1   Skoda     120000  Diesel  Second Owner         370000

In [6]:
#using python code
pd.get_dummies(df, columns=['fuel', 'owner'], dtype=int)

,brand,km_driven,selling_price,fuel_CNG,fuel_Diesel,fuel_LPG,fuel_Petrol,owner_First Owner,owner_Fourth & Above Owner,owner_Second Owner,owner_Test Drive Car,owner_Third Owner
0,Maruti,145500,450000,0,1,0,0,1,0,0,0,0
1,Skoda,120000,370000,0,1,0,0,0,0,1,0,0
2,Honda,140000,158000,0,0,0,1,0,0,0,0,1
3,Hyundai,127000,225000,0,1,0,0,1,0,0,0,0
4,Maruti,120000,130000,0,0,0,1,1,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...
8123,Hyundai,110000,320000,0,0,0,1,1,0,0,0,0
8124,Hyundai,119000,135000,0,1,0,0,0,1,0,0,0
8125,Maruti,120000,382000,0,1,0,0,1,0,0,0,0
8126,Tata,25000,290000,0,1,0,0,1,0,0,0,0
8127,Tata,25000,290000,0,1,0,0,1,0,0,0,0

#code which use in ml for removing data

In [7]:
from sklearn.model_selection import train_test_split

In [8]:
x_train,x_test,y_train,y_test=train_test_split(df.iloc[:,0:4],df.iloc[:,-1],test_size=0.2,random_state=2)

In [9]:
x_train.shape

(6502, 4)

In [10]:
y_train.shape

(6502,)

In [11]:
from sklearn.preprocessing import OneHotEncoder

In [12]:
from sklearn.preprocessing import OrdinalEncoder

In [13]:
one=OneHotEncoder(drop='first')

In [14]:
x_trained=one.fit_transform(x_train[['fuel','owner']]).toarray()

In [15]:
X_test_new = one.transform(x_test[['fuel','owner']])

In [16]:
x_trained.shape

(6502, 7)

In [17]:
import numpy as np
np.hstack((x_train[['brand','km_driven']].values,x_trained))

array([['Hyundai', 35000, 1.0, ..., 0.0, 0.0, 0.0],
       ['Jeep', 60000, 1.0, ..., 0.0, 0.0, 0.0],
       ['Hyundai', 25000, 0.0, ..., 0.0, 0.0, 0.0],
       ...,
       ['Tata', 15000, 0.0, ..., 0.0, 0.0, 0.0],
       ['Maruti', 32500, 1.0, ..., 1.0, 0.0, 0.0],
       ['Isuzu', 121000, 1.0, ..., 0.0, 0.0, 0.0]], dtype=object)

# code for one hot incoding for the given more frequence colums

In [18]:
counts=df['brand'].value_counts()

In [19]:
df['brand'].nunique()

32

In [20]:
repl = counts[counts <= 100].index

In [22]:
pd.get_dummies(df['brand'].replace(repl, 'other'),dtype=int).sample(5)

,BMW,Chevrolet,Ford,Honda,Hyundai,Mahindra,Maruti,Renault,Skoda,Tata,Toyota,Volkswagen,other
146,0,0,0,0,0,0,0,0,0,0,0,0,1
4526,0,0,0,0,0,0,0,0,0,0,0,1,0
6469,0,0,0,0,1,0,0,0,0,0,0,0,0
3187,0,0,0,0,1,0,0,0,0,0,0,0,0
7815,0,0,0,1,0,0,0,0,0,0,0,0,0

In [23]:
df.head(2)

    brand  km_driven    fuel         owner  selling_price
0  Maruti     145500  Diesel   First Owner         450000
1   Skoda     120000  Diesel  Second Owner         370000